Repository: Leoooog/orderly
Catalog: lib/l10n/app_*.arb
Languages: it

# headerAppMetadata
source: --- Titles and General Info ---
it: --- Titoli e Info Generali ---

# waiterAppName
source: Orderly - Waiter
it: Orderly - Sala

# kitchenAppName
source: Orderly - Kitchen
it: Orderly - Cucina

# posAppName
source: Orderly - POS
it: Orderly - Cassa

# headerAuth
source: --- Authentication ---
it: --- Autenticazione ---

# loginInsertPin
source: Enter Waiter PIN
it: Inserisci PIN Cameriere

# loginPinError
source: Wrong PIN
it: PIN Errato

# headerNavigation
source: --- Navigation ---
it: --- Navigazione ---

# navTables
source: Hall
it: Sala

# navTableHistory
source: AT TABLE
it: AL TAVOLO

# msgBack
source: Back
it: Indietro

source: Exit
it: Esci

# headerTableStatus
source: --- Table Status (Logic) ---
it: --- Stati del Tavolo (Logica) ---

# tableStatusFree
source: FREE
it: LIBERO

# tableStatusSeated
source: WAITING
it: ATTESA

# tableStatusOrdered
source: ORDERED
it: ORDINATO

# tableStatusReady
source: READY
it: PRONTO

# tableStatusEating
source: SERVED
it: SERVITO

# headerTableActions
source: --- Table Management (Hall) ---
it: --- Gestione Tavoli (Sala) ---

# tableActions
source: Actions for Table {tableName}
it: Azioni Tavolo {tableName}

# tableName
source: Table {tableName}
it: Tavolo {tableName}

# dialogOpenTable
source: Opening {tableName}
it: Apertura {tableName}

# btnOpen
source: Open Table
it: Apri Tavolo

# dialogGuests
source: How many guests?
it: Quanti Coperti?

# labelGuests
source: Guests: {guests}
it: Coperti: {guests}

# actionMove
source: Move Table
it: Sposta Tavolo

# actionTransfer
source: Transfer to a free table
it: Trasferisci su un tavolo libero

# dialogMoveTable
source: Move to...
it: Sposta su...

# actionMerge
source: Merge Table
it: Unisci Tavolo

# actionMergeDesc
source: Merge with an occupied table
it: Unisci a un tavolo occupato

# dialogMergeTable
source: Merge with...
it: Unisci a...

# actionCancelTable
source: Void Table
it: Annulla Tavolo

# actionResetDesc
source: Close table without payment
it: Chiudi tavolo senza incasso

# msgConfirmCancelTable
source: You are about to void table {tableName}. All current orders will be lost and the table will become free without recording revenue. Are you sure?
it: Stai per annullare il tavolo {tableName}. Tutti gli ordini correnti verranno persi e il tavolo tornerà libero senza registrare incasso. Sei sicuro?

# msgTableOpened
source: Table {tableName} opened
it: Tavolo {tableName} aperto

# tableMoved
source: Table moved successfully
it: Tavolo spostato con successo

# tableMerged
source: Tables merged successfully
it: Tavoli uniti con successo

# tableReset
source: Table voided and reset
it: Tavolo annullato e resettato

# msgNoTablesAvailable
source: No tables available
it: Nessun tavolo disponibile

# headerMenuCart
source: --- Menu and Cart ---
it: --- Menu e Carrello ---

# labelSearch
source: Search product...
it: Cerca prodotto...

# labelNoProducts
source: No products found
it: Nessun prodotto trovato

# labelIngredients
source: INGREDIENTS
it: INGREDIENTI

# labelAllergens
source: ALLERGENS
it: ALLERGENI

# cartSheetTitle
source: Order
it: Comanda

# cartSheetItemsCountLabel
source: {count, plural, =0{No items} =1{1 item} other{{count} items}}
it: {count, plural, =0{Nessun articolo} =1{1 articolo} other{{count} articoli}}

# cartEditingItem
source: Editing: {itemName}
it: Stai modificando: {itemName}

# cartEditingQuantity
source: How many dishes do you want to edit?
it: Quanti piatti vuoi modificare?

# dialogMoveToCourse
source: Move to:
it: Sposta in:

# labelExtras
source: Add-ons (Extras):
it: Aggiunte (Extra):

# labelNotesTitle
source: Kitchen Notes
it: Note Cucina

# fieldNotesPlaceholder
source: Ex. No onion...
it: Es. No cipolla...

# btnEdit
source: EDIT
it: MODIFICA

# labelEdit
source: Edit
it: Modifica

# subtitleEditItemAction
source: Change notes or variants
it: Cambia note o varianti

# btnSendKitchen
source: SEND ORDER
it: INVIA COMANDA

# msgOrderSent
source: Order sent!
it: Comanda inviata!

# msgChangesSaved
source: Changes saved
it: Modifiche salvate

# msgChangesNotSaved
source: Changes not saved
it: Modifiche non salvate

# msgExitWithoutSaving
source: Do you want to exit without sending the order? All changes will be lost.
it: Vuoi uscire senza inviare la comanda?

# headerKitchenFlow
source: --- Kitchen Flow and Courses ---
it: --- Flusso Cucina e Portate ---

# btnFireCourse
source: FIRE COURSE
it: DAI IL VIA

# msgCourseFired
source: 'Fire' requested for {course}
it: Richiesto 'Via' per {course}

# itemStatusPending
source: Pending
it: In Attesa

# itemStatusFired
source: Sent to kitchen
it: Inviato in cucina

# itemStatusCooking
source: Cooking
it: In Cottura

# itemStatusReady
source: Ready
it: Pronto

# itemStatusServed
source: Served
it: Servito

# badgeStatusInQueue
source: IN QUEUE
it: IN CODA

# badgeStatusCooking
source: PREPARING
it: IN PREPARAZIONE

# badgeStatusReady
source: READY TO SERVE
it: PRONTO DA SERVIRE

# badgeStatusCompleted
source: COMPLETED
it: COMPLETATO

# btnMarkServed
source: SERVE
it: SERVI

# labelNoOrders
source: No orders placed
it: Nessun ordine effettuato

# headerBillPayment
source: --- Bill and Payments ---
it: --- Conto e Pagamenti ---

# actionQuickPay
source: Quick Pay
it: Incasso Rapido

# actionPayTotalDesc
source: Pay full amount without splitting
it: Paga tutto senza dividere

# actionSplitPay
source: Cashier / Split
it: Cassa / Divisione

# actionSplitDesc
source: Manage partial payments
it: Gestisci pagamenti parziali

# dialogPaymentTable
source: Payment {tableName}
it: Incasso {tableName}

# labelPaymentTotal
source: Total to pay
it: Totale da incassare

# dialogSelectPaymentMethod
source: Select method (Pay All):
it: Seleziona metodo (Paga Tutto):

# cardPayment
source: Card
it: Carta

# cashPayment
source: Cash
it: Contanti

# billSplitEach
source: By Item
it: Per Piatto

# billSplitEvenly
source: Even Split
it: Alla Romana

# selectToPay
source: Select what to pay
it: Seleziona cosa pagare

source: Select All
it: Seleziona tutto

# unselectAll
source: Deselect All
it: Deseleziona tutto

source: All selected
it: Tutto selezionato

# labelSplitEvenlyDescription
source: In how many parts to split?
it: In quante parti dividere?

source: Total people
it: Persone totali

# labelPartsToPay
source: Shares to pay now:
it: Quote da pagare ora:

# infoPartsPaying
source: {payingParts} shares out of {splitParts}
it: {payingParts} quote su {splitParts}

# labelSinglePart
source: Single share:
it: Quota singola:

# labelTotal
source: Total
it: Totale

# infoTotalAmount
source: Total: {total}
it: Totale: {total}

# labelToPay
source: TO PAY
it: DA PAGARE

# labelRemaining
source: REMAINING
it: RIMANENTE

# infoPriceEach
source: {price} each
it: {price} cad.

# btnPay
source: PAY
it: PAGA

# msgPaymentSuccess
source: Payment recorded
it: Pagamento registrato

# headerVoids
source: --- Voids and Cancellations ---
it: --- Storni e Cancellazioni ---

# titleVoidItem
source: Void Item
it: Storno Piatto

# titleVoidItemAction
source: Void / Delete
it: Storna / Elimina

# subtitleVoidItemAction
source: Remove dish from order
it: Rimuovi piatto dall'ordine

# titleVoidItemDialog
source: Delete: {itemName}
it: Elimina: {itemName}

# labelVoidQuantity
source: Quantity to void:
it: Quantità da stornare:

# labelVoidReasonPlaceholder
source: Reason:
it: Motivazione:

# dialogConfirmVoid
source: CONFIRM VOID
it: CONFERMA STORNO

# labelRefundOption
source: Refund the amount?
it: Rimborsare l'importo?

# labelViewVoided
source: View voids
it: Vedi storni

# labelNoVoidedItems
source: No voids recorded
it: Nessuno storno registrato

# labelVoidedList
source: Void History {tableName}
it: Storico Storni {tableName}

# labelVoidReason
source: Reason: {reason} {hour}:{minutes} {isRefunded, select, false{Not Refunded, } true{Refunded, } other{}} {statusWhenVoided, select, pending{Pending} served{Served} cooking{Cooking} fired{Sent to kitchen} ready{Ready} other{}}
it: Motivo: {reason} {hour}:{minutes} {isRefunded, select, false{Non Rimborsato, } true{Rimborsato, } other{}} {statusWhenVoided, select, pending{In Attesa} served{Servito} cooking{In Cottura} fired{Inviato in cucina} ready{Pronto} other{}}

# msgVoidItem
source: Item voided successfully
it: Piatto stornato correttamente

# headerGeneral
source: --- General Labels ---
it: --- Etichette Generiche ---

# labelAll
source: All
it: Tutti

# dialogConfirm
source: CONFIRM
it: CONFERMA

# dialogCancel
source: Cancel
it: Annulla

# dialogSave
source: Save
it: Salva

# dialogEdit
source: Edit
it: Modifica

# msgAttention
source: Attention
it: Attenzione
